cask_args appdir: '/Applications'

# Command line tools
brew 'awscli'                       # AWS Command Line Interface
brew 'coreutils'                    # GNU File, Shell, and Text utilities
brew 'dockutil'                     # Command line utility for managing macOS dock items
brew 'duti'                         # Set default applications for file types
brew 'gh'                           # GitHub CLI for managing repositories
brew 'git'                          # Version control system
brew 'git-lfs'                      # Git Large File Storage
brew 'go-task'                      # Task runner / build tool
brew 'helm'                         # Kubernetes package manager
brew 'helmfile'                     # Deploy and manage Helm charts
brew 'imagemagick'                  # Image manipulation library and tools
brew 'jq'                           # Command-line JSON processor
brew 'kubernetes-cli'               # Kubernetes command line tools
brew 'kustomize'                    # Kubernetes configuration management tool
brew 'mas'                          # Mac App Store command line interface
brew 'mise'                         # Runtime version manager (successor to asdf)
brew 'pandoc'                       # Document converter
brew 'pipx'                         # Install and run Python applications in isolated environments
brew 'python-yq'                    # Command-line YAML processor using jq
brew 'spaceman-diff'                # Diff images from the command line
brew 'usql'                         # Universal command-line interface for SQL databases
brew 'usage'                        # Tool for working with usage-spec CLIs
brew 'vim'                          # Highly configurable text editor built
brew 'vultr'                        # Vultr CLI for managing cloud resources
brew 'watchman'                     # File watching service for triggering actions on file changes
brew 'wget'                         # File download utility
brew 'zsh-syntax-highlighting'      # Fish shell-like syntax highlighting for Zsh

# Desktop applications
cask 'android-studio'               # Android development IDE
cask 'apidog'                       # API development and testing tool
cask 'chatgpt'                      # ChatGPT desktop client
cask 'cleanshot'                    # Screenshot and screen recording tool
cask 'cursor'                       # Source code editor
cask 'figma'                        # Design tool
cask 'font-fira-code'               # Programming font with ligatures (Default)
cask 'font-fira-mono'               # Programming font with ligatures (Mono)
cask 'font-jetbrains-mono'          # Programming font with ligatures (Mono)
cask 'font-maple-mono'              # Programming font with ligatures (Mono)
cask 'font-monaspace'               # Programming font with ligatures (All styles)
cask 'google-chrome'                # Google Chrome browser
cask 'iterm2'                       # Terminal emulator for macOS
cask 'itermai'                      # AI-powered code assistant
cask 'lens'                         # Kubernetes IDE
cask 'ngrok'                        # Secure tunnel to localhost
cask 'notion'                       # Knowledge management and note-taking
cask 'obsidian'                     # Knowledge base that works on local Markdown files
cask 'orbstack'                     # Docker Desktop alternative for macOS
cask 'protonvpn'                    # VPN client
cask 'raycast'                      # Spotlight alternative with extensions
cask 'readdle-spark'                # Email client with smart features
cask 'rectangle-pro'                # Window management tool
cask 'spotify'                      # Music streaming service
cask 'tableplus'                    # Database management tool
cask 'vlc'                          # Media player supporting various formats

# Mac App Store applications
mas 'Archiver 4', id: 1556026599                    # (Un)compress files
mas 'Amphetamine', id: 937984704                    # Keep your Mac awake
mas 'Bitwarden', id: 1352778147                     # Open-source password manager
mas 'FileZilla', id: 1298486723                     # FTP client
mas 'Paste - Limitless Clipboard', id: 967805235   # Clipboard manager for macOS
mas 'Shortcut Keeper', id: 1585404175               # Save keyboard shortcuts
mas 'WhatsApp Messenger', id: 310633997             # WhatsApp Client
mas 'Xcode', id: 497799835                          # Apple's integrated development environment
mas 'Yubico Authenticator', id: 1497506650          # 2FA app for YubiKey


# Cursor Extensions
# TODO: Fix brew bundle cursor plugin

# cursor 'anysphere.remote-containers'                       # Use Docker containers as your development environment
# cursor 'bierner.markdown-checkbox'                         # Enhance Markdown with checkboxes
# cursor 'bierner.markdown-emoji'                            # Emoji support for Markdown
# cursor 'bierner.markdown-footnotes'                        # Footnote support for Markdown
# cursor 'bierner.markdown-mermaid'                          # Mermaid diagram support for Markdown
# cursor 'bierner.markdown-preview-github-styles'            # GitHub-style Markdown preview
# cursor 'bierner.markdown-yaml-preamble'                    # YAML preamble support for Markdown
# cursor 'bradlc.vscode-tailwindcss'                         # Tailwind CSS IntelliSense
# cursor 'chakrounanas.turbo-console-log'                    # Turbo Console Log
# cursor 'christian-kohler.npm-intellisense'                 # NPM IntelliSense
# cursor 'christian-kohler.path-intellisense'                # Path IntelliSense
# cursor 'codezombiech.gitignore'                            # .gitignore file support
# cursor 'csstools.postcss'                                  # PostCSS support
# cursor 'davidanson.vscode-markdownlint'                    # Markdown linting
# cursor 'dbaeumer.vscode-eslint'                            # ESLint integration
# cursor 'docker.docker'                                     # Docker DX
# cursor 'edwinhuish.better-comments-next'                   # Help you create more human-friendly comments
# cursor 'esbenp.prettier-vscode'                            # Prettier
# cursor 'jock.svg'                                          # SVG Viewer
# cursor 'miguelsolorio.fluent-icons'                        # Fluent Icons
# cursor 'mikestead.dotenv'                                  # .env File Support
# cursor 'monokai.theme-monokai-pro-vscode'                  # Monokai Pro Theme
# cursor 'ms-azuretools.vscode-containers'                   # Build, manage, and deploy containerized applications
# cursor 'ms-azuretools.vscode-docker'                       # Docker Extension Pack
# cursor 'ms-vscode-remote.remote-ssh'                       # Remote - SSH
# cursor 'ms-vscode-remote.remote-ssh-edit'                  # Remote - SSH: Editing
# cursor 'ms-vscode.remote-explorer'                         # Remote - Explorer
# cursor 'pflannery.vscode-versionlens'                      # Version Lens
# cursor 'redhat.vscode-yaml'                                # YAML Support
# cursor 'streetsidesoftware.code-spell-checker'             # A basic spell checker
# cursor 'streetsidesoftware.code-spell-checker-portuguese'  # PT-BR Dict for spell checker
# cursor 'tamasfe.even-better-toml'                          # Even Better TOML
# cursor 'usernamehw.errorlens'                              # Error Lens
# cursor 'waderyan.gitblame'                                 # Git Blame
# cursor 'wix.vscode-import-cost'                            # Import Cost
# cursor 'yoavbls.pretty-ts-errors'                          # Pretty TypeScript Errors
