cask_args appdir: '/Applications'

# Command line tools
# brew 'awscli'      # AWS Command Line Interface
# brew 'cloudflared' # Cloudflare tunnel client
brew 'coreutils'     # GNU File, Shell, and Text utilities
brew 'dockutil'      # Command line utility for managing macOS dock items
brew 'git'           # Version control system
brew 'git-lfs'       # Git Large File Storage
brew 'helm'          # Kubernetes package manager
brew 'helmfile'      # Deploy and manage Helm charts
brew 'imagemagick'   # Image manipulation library and tools
brew 'jq'            # Command-line JSON processor
brew 'mas'           # Mac App Store command line interface
brew 'mise'          # Runtime version manager (successor to asdf)
brew 'spaceman-diff' # Diff images from the command line
brew 'usage'         # Tool for working with usage-spec CLIs
brew 'vim'           # Highly configurable text editor built
brew 'wget'          # File download utility

# Desktop applications
# cask 'android-studio'       # Android development IDE
# cask 'apidog'               # API development and testing tool
# cask 'bartender'            # Menu bar organization tool
# cask 'beeper'            		# Universal chat app powered by Matrix
# cask 'bitwarden'            # Password manager
# cask 'cleanshot'            # Screenshot and screen recording tool
# cask 'figma'                # Design and prototyping tool
cask 'font-fira-code'         # Programming font with ligatures
cask 'font-fira-mono'         # Monospace programming font
# cask 'ghostty'              # Modern terminal emulator
# cask 'gitkraken'            # Git GUI client
# cask 'lens'                 # Kubernetes IDE
# cask 'ngrok'                # Secure tunnel to localhost
# cask 'obsidian'             # Knowledge management and note-taking
cask 'orbstack'               # Docker Desktop alternative for macOS
# cask 'protonvpn'            # VPN client
# cask 'raycast'              # Spotlight alternative with extensions
# cask 'readdle-spark'        # Email client with smart features
# cask 'rectangle-pro'        # Window management tool
# cask 'spotify'              # Music streaming service
# cask 'tableplus'            # Database management tool
# cask 'todoist'              # Task and project management
cask 'visual-studio-code'     # Code editor
# cask 'vlc'                  # Media player
# cask 'zen'                  # Privacy-focused browser

# Mac App Store applications
# mas 'Yubico Authenticator', id: 1497506650 # 2FA app for YubiKey
mas 'Xcode', id: 497799835                   # Apple's integrated development environment

# VS Code extensions
vscode "aaron-bond.better-comments"             # Improved commenting with highlights
vscode "bradlc.vscode-tailwindcss"              # Tailwind CSS IntelliSense
vscode "christian-kohler.npm-intellisense"      # npm modules IntelliSense
vscode "christian-kohler.path-intellisense"     # File path autocomplete
vscode "codezombiech.gitignore"                 # .gitignore file templates
vscode "csstools.postcss"                       # PostCSS language support
vscode "dbaeumer.vscode-eslint"                 # ESLint integration
vscode "eamodio.gitlens"                        # Git supercharged - history, blame, and more
vscode "esbenp.prettier-vscode"                 # Code formatter
vscode "figma.figma-vscode-extension"           # Figma integration for design tokens
vscode "formulahendry.auto-close-tag"           # Auto close HTML/XML tags
vscode "formulahendry.auto-rename-tag"          # Auto rename paired HTML/XML tags
vscode "jock.svg"                               # SVG viewer and editor
vscode "mechatroner.rainbow-csv"                # CSV/TSV syntax highlighting
vscode "mikestead.dotenv"                       # .env file syntax highlighting
vscode "monokai.theme-monokai-pro-vscode"       # Monokai Pro theme
vscode "ms-azuretools.vscode-docker"            # Docker support
vscode "ms-vscode-remote.remote-containers"     # Dev containers support
vscode "ms-vscode-remote.remote-ssh"            # Remote SSH development
vscode "ms-vscode-remote.remote-ssh-edit"       # SSH configuration editing
vscode "ms-vscode.remote-explorer"              # Remote development explorer
vscode "ms-vscode.vscode-typescript-next"       # Latest TypeScript features
vscode "msjsdiag.vscode-react-native"           # React Native development tools
vscode "mtxr.sqltools"                          # Database management and query runner
vscode "mtxr.sqltools-driver-mysql"             # MySQL driver for SQLTools
vscode "mtxr.sqltools-driver-pg"                # PostgreSQL driver for SQLTools
vscode "mtxr.sqltools-driver-sqlite"            # SQLite driver for SQLTools
vscode "redhat.vscode-yaml"                     # YAML language support
vscode "tamasfe.even-better-toml"               # TOML language support
vscode "usernamehw.errorlens"                   # Inline error highlighting
vscode "waderyan.gitblame"                      # Git blame annotations
vscode "wallabyjs.console-ninja"                # Advanced console.log output
vscode "wix.vscode-import-cost"                 # Display import/require package size
vscode "yoavbls.pretty-ts-errors"               # TypeScript error beautification
vscode "yzhang.markdown-all-in-one"             # Markdown editing tools
