cask_args appdir: '/Applications'

# Command line tools
brew 'awscli'      			       # AWS Command Line Interface
brew 'coreutils'     		       # GNU File, Shell, and Text utilities
brew 'dockutil'      		       # Command line utility for managing macOS dock items
brew 'duti'					 		       # Set default applications for file types
brew 'git'           		       # Version control system
brew 'git-lfs'       		       # Git Large File Storage
brew 'gh'           		       # GitHub CLI for managing repositories
brew 'go-task'                 # Task runner / build tool
brew 'helm'          		       # Kubernetes package manager
brew 'helmfile'      		       # Deploy and manage Helm charts
brew 'imagemagick'   		       # Image manipulation library and tools
brew 'jq'            		       # Command-line JSON processor
brew 'kubernetes-cli' 	       # Kubernetes command line tools
brew 'kustomize'    		       # Kubernetes configuration management tool
brew 'mas'           		       # Mac App Store command line interface
brew 'mise'          		       # Runtime version manager (successor to asdf)
brew 'pandoc'         	       # Document converter
brew 'python-yq'  	 		       # Command-line YAML processor using jq
brew 'spaceman-diff' 		       # Diff images from the command line
brew 'usql'   		             # Universal command-line interface for SQL databases
brew 'usage'         		       # Tool for working with usage-spec CLIs
brew 'vim'           		       # Highly configurable text editor built
brew 'vultr'          	       # Vultr CLI for managing cloud resources
brew 'watchman'      		       # File watching service for triggering actions on file changes
brew 'wget'          		       # File download utility
brew 'zsh-syntax-highlighting' # Fish shell-like syntax highlighting for Zsh

# Desktop applications
cask 'android-studio'         # Android development IDE
cask 'arc'                    # Privacy-focused browser
cask 'apidog'                 # API development and testing tool
cask 'archiver-app'           # File archiving and compression tool
cask 'chatgpt' 				  			# ChatGPT desktop client
cask 'cleanshot'              # Screenshot and screen recording tool
cask 'figma'                  # Design tool
cask 'font-monaspace'      	  # Programming font with ligatures (All styles)
cask 'iterm2'                 # Terminal emulator for macOS
cask 'itermai'                # AI-powered code assistant
cask 'lens'                   # Kubernetes IDE
cask 'ngrok'                  # Secure tunnel to localhost
cask 'notion'                 # Knowledge management and note-taking
cask 'obsidian'                # Knowledge base that works on local Markdown files
cask 'orbstack'               # Docker Desktop alternative for macOS
cask 'protonvpn'              # VPN client
cask 'raycast'                # Spotlight alternative with extensions
cask 'readdle-spark'          # Email client with smart features
cask 'rectangle-pro'          # Window management tool
cask 'spotify'                # Music streaming service
cask 'tableplus'              # Database management tool
cask 'todoist-app'            # Task management and to-do list
cask 'visual-studio-code'     # Source code editor
cask 'vlc'                    # Media player supporting various formats

# Mac App Store applications
mas 'Amphetamine', id: 937984704         	        # Keep your Mac awake
mas 'Bitwarden', id: 1352778147 							   	# Open-source password manager
mas 'FileZilla', id: 1298486723 									# FTP client
mas 'Paste - Limitless Clipboard', id: 967805235 	# Clipboard manager for macOS
mas 'Yubico Authenticator', id: 1497506650       	# 2FA app for YubiKey
mas 'Xcode', id: 497799835                       	# Apple's integrated development environment

# VSCode Extensions
vscode 'anthropic.claude-code'                      # Claude AI integration for VSCode
vscode 'bierner.markdown-checkbox'                  # Enhance Markdown with checkboxes
vscode 'bierner.markdown-emoji'                     # Emoji support for Markdown
vscode 'bierner.markdown-footnotes'                 # Footnote support for Markdown
vscode 'bierner.markdown-mermaid'                   # Mermaid diagram support for Markdown
vscode 'bierner.markdown-preview-github-styles'     # GitHub-style Markdown preview
vscode 'bierner.markdown-yaml-preamble'             # YAML preamble support for Markdown
vscode 'bradlc.vscode-tailwindcss'                  # Tailwind CSS IntelliSense
vscode 'chakrounanas.turbo-console-log'             # Turbo Console Log
vscode 'christian-kohler.npm-intellisense'          # NPM IntelliSense
vscode 'christian-kohler.path-intellisense'         # Path IntelliSense
vscode 'codezombiech.gitignore'                     # .gitignore file support
vscode 'csstools.postcss'                           # PostCSS support
vscode 'davidanson.vscode-markdownlint'             # Markdown linting
vscode 'dbaeumer.vscode-eslint'                     # ESLint integration
vscode 'docker.docker'                              # Docker support
vscode 'esbenp.prettier-vscode'                     # Prettier
vscode 'esdete.tailwind-rainbow'                    # Tailwind Rainbow
vscode 'etsi0.class-collapse'                       # Class Collapse
vscode 'github.copilot'                             # GitHub Copilot
vscode 'github.copilot-chat'                        # GitHub Copilot Chat
vscode 'gruntfuggly.todo-tree'                      # Highlight TODOs in code
vscode 'humao.rest-client'                          # REST Client
vscode 'jock.svg'                                   # SVG Viewer
vscode 'miguelsolorio.fluent-icons'                 # Fluent Icons
vscode 'mikestead.dotenv'                           # .env File Support
vscode 'monokai.theme-monokai-pro-vscode'           # Monokai Pro Theme
vscode 'ms-vscode-remote.remote-ssh'                # Remote - SSH
vscode 'ms-vscode-remote.remote-ssh-edit'           # Remote - SSH: Editing
vscode 'ms-vscode.remote-explorer'                  # Remote - Explorer
vscode 'pflannery.vscode-versionlens'               # Version Lens
vscode 'redhat.vscode-yaml'                         # YAML Support
vscode 'tamasfe.even-better-toml'                   # Even Better TOML
vscode 'tyriar.sort-lines'                          # Sort Lines
vscode 'usernamehw.errorlens'                       # Error Lens
vscode 'waderyan.gitblame'                          # Git Blame
vscode 'wix.vscode-import-cost'                     # Import Cost
vscode 'yoavbls.pretty-ts-errors'                   # Pretty TypeScript Errors
